var classifyRules = [
    {
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"北京菜",
        rules:["全聚德","那家小馆","小吊梨汤"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"安徽菜",
        rules:["徽轩居"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"山西菜",
        rules:["山右晋菜中餐厅"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"福建菜",
        rules:["武夷私房菜","八闽食府"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"河南菜",
        rules:["金狮麟"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"鲁菜",
        rules:["儒宴孔府菜"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"川菜",
        rules:["眉州东坡酒楼"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"湘菜",
        rules:["湘鄂情"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"湖北菜",
        rules:["九头鹰"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"淮扬菜",
        rules:["科力淮扬村(西站店)"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"浙江菜",
        rules:["外婆家"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"上海菜",
        rules:["鹭鹭酒家"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"南京菜",
        rules:["南京大牌档"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"苏州菜",
        rules:["苏州太太私房菜"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"粤菜",
        rules:["八号公馆"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"东北菜",
        rules:["黑土情"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"新疆菜",
        rules:["雅克西新疆菜"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"西北菜",
        rules:["西贝西北菜"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"云贵菜",
        rules:["中8楼"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"民族菜",
        rules:["什刹海汉仓客家菜","金鼎轩"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"台湾菜",
        rules:["鼎泰丰"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"天津菜",
        rules:["狗不理包子"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"江苏菜",
        rules:["福泰宫","淮扬春饭店","无名居","常州宾馆餐厅"]
    },{
        topcategory:"美食",
        subcategory:"中餐厅",
        reclassify:"酒楼",
        rules:["文月阁饭庄"]
    },{
        topcategory:"美食",
        subcategory:"日韩菜",
        reclassify:"日本料理",
        rules:["××日本料理","××寿司","味千拉面","喜多屋","将台无二"]
    },{
        topcategory:"美食",
        subcategory:"日韩菜",
        reclassify:"韩国料理",
        rules:["久久小豆腐","××韩国","××韩式狗肉","××韩式烤肉","××高丽风味料理","××韩式冷面馆","汉拿山","权金城","大长今","正一味","三千里",]
    }, {
        topcategory:"美食",
        subcategory:"东南亚菜",
        reclassify:"印度菜",
        rules:["印度小厨"]
    },{
        topcategory:"美食",
        subcategory:"东南亚菜",
        reclassify:"星马菜",
        rules:["胡姬•兰"]
    },{
        topcategory:"美食",
        subcategory:"东南亚菜",
        reclassify:"泰国菜",
        rules:["焦叶"]
    },{
        topcategory:"美食",
        subcategory:"东南亚菜",
        reclassify:"越南菜",
        rules:["西贡越南菜"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"美国菜",
        rules:["纽约三明治"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"葡国菜",
        rules:["澳门葡国餐厅"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"俄罗斯菜",
        rules:["基辅罗斯餐厅"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"地中海菜",
        rules:["卡门西班牙餐厅"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"意大利菜",
        rules:["安妮意大利餐厅(日坛公园店)"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"巴西菜",
        rules:["Alameda"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"拉美烧烤",
        rules:["巴犀烧烤餐厅"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"比萨",
        rules:["必胜客"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"法国菜",
        rules:["马克西姆"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"牛排",
        rules:["豪客来"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"英国菜",
        rules:["Must Guette"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"德国菜",
        rules:["兰特伯爵西餐厅·啤酒屋(方庄店)"]
    },{
        topcategory:"美食",
        subcategory:"西餐",
        reclassify:"墨西哥菜",
        rules:["xalapa墨西哥菜"]
    },{
        topcategory:"美食",
        subcategory:"官府菜",
        reclassify:"",
        rules:["谭家菜","孔府官府菜","东坡菜","云林菜","随园菜","段家菜"]
    },{
        topcategory:"美食",
        subcategory:"家常菜",
        reclassify:"",
        rules:["郭林家常菜"]
    },{
        topcategory:"美食",
        subcategory:"私家菜",
        reclassify:"",
        rules:["广东味芝朗私房菜"]
    },{
        topcategory:"美食",
        subcategory:"烧烤",
        reclassify:"",
        rules:["西单烤翅"]
    },{
        topcategory:"美食",
        subcategory:"火锅",
        reclassify:"",
        rules:["老北京涮肉","台湾小火锅","日式火锅"]
    },{
        topcategory:"美食",
        subcategory:"海鲜",
        reclassify:"",
        rules:["唐宫海鲜舫"]
    },{
        topcategory:"美食",
        subcategory:"素食",
        reclassify:"",
        rules:["净心莲"]
    },{
        topcategory:"美食",
        subcategory:"小吃快餐",
        reclassify:"",
        rules:["成都小吃","久久丫","老家肉饼","驴肉火烧","九门小吃","麻辣烫","过桥米线","羊肉泡馍","庆丰包子","马兰拉面","麦当劳","永和大王","李先生牛肉面等连锁店"]
    },{
        topcategory:"美食",
        subcategory:"清真",
        reclassify:"",
        rules:["兰州拉面"]
    },{
        topcategory:"美食",
        subcategory:"自助餐",
        reclassify:"",
        rules:["巴西烧烤"]
    },{
        topcategory:"美食",
        subcategory:"面包甜点",
        reclassify:"",
        rules:["味多美","泡芙店"]
    },{
        topcategory:"美食",
        subcategory:"茶餐厅",
        reclassify:"",
        rules:["仙踪林","港丽餐厅","又及餐厅","绿茶餐厅"]
    },{
        topcategory:"美食",
        subcategory:"冷饮店",
        reclassify:"",
        rules:["哈根达斯","一点点奶茶","CoCo都可"]
    },{
        topcategory:"公司企业",
        subcategory:"公司企业",
        reclassify:"",
        rules:["国美电器控股有限公司"]
    },{
        topcategory:"公司企业",
        subcategory:"农林牧渔基地",
        reclassify:"",
        rules:["锦坤生态农业园","开新农场","老马渔场","东北旺苗圃"]
    },{
        topcategory:"公司企业",
        subcategory:"企业/工厂",
        reclassify:"",
        rules:["中央财经大学印刷厂","北京市兽医生物药品厂"]
    },{
        topcategory:"机构团体",
        subcategory:"外国机构",
        reclassify:"",
        rules:["××(外国)代表处", "××(外国)联络部", "××国际合作协会", "瑞士国家旅游局北京办事处", "××大使馆官邸", "××大使官邸", "××领事馆商务处", "××领事馆农业贸易处", "××领事馆签证处", "××领事馆文化处", "××领事馆签证代办处", "××领事馆信息产业处", "××大使馆", "联合国××", "国际××", "世界××", "国际竹藤组织", "世界动物卫生组织", "世界知识产权组织", "国际反捕鲸委员会", "国际反贪局联合会", "世界医护人员联盟", "亚太空间合作组织", "国际红十字会与红新月会联合会", "世界休闲组织", "国际会计师联合会", "国际志愿服务协调委员会", "世界科技城市联盟", "世界佛教徒联谊会", "国际自然及自然资源保护联盟", "国际新闻电影协会", "世界土著人理事会", "国际翻译工作者联合会", "无国界医生组织", "世界穆斯林大会", "国际图书馆协会联合会 ", "国际奥比斯组织", "国际大学协会", "国际新闻工作者联合会", "国际战略研究所", "国际新闻学会", "国际新闻工作者协会", "国际世界语协会", "世界厕所组织", "国际信息处理联合会", "国际音乐理事会", "世界盲人联盟", "世界汉语教学学会", "国际军体理事会", "万国邮政联盟", "国际交流发展计划", "世界遗产委员会", "国际奥委会", "国际自由工会联合会", "国际档案理事会", "亚奥理事会", "世界基督教会联合会", "国际科学理事会", "国际足联", "世界民主青年联盟", "第三世界科学院 ", "世卫组织", "国际货币基金组织", "反洗钱金融行动特别工作组", "发展中八国集团", "黑海经合组织", "科托努协定", "国际航空运输协会", "拉美一体化协会", "世界能源理事会", "大湄公河次区域经济合作", "中美洲一体化体系", "拉美经济体系", "国际能源机构", "加勒比共同体和共同市场", "西非经济货币联盟", "东非共同体", "世界旅游组织", "非洲发展新伙伴计划", "东南非共同市场", "太平洋共同体", "博鳌亚洲论坛", "大湖国家经济共同体", "太平洋岛国论坛", "安第斯共同体", "关贸总协定", "西非国家经济共同体", "比荷卢经济联盟", "南方共同市场", "国际展览局", "南部非洲发展共同体", "欧洲自由贸易联盟", "２４国集团", "中部非洲国家经济共同体", "环印度洋地区合作联盟", "１５国集团", "阿拉伯石油输出国组织", "经合组织", "政府间发展组织(伊加特)", "石油输出国组织", "亚太经合组织", "世贸组织", "中国－阿拉伯国家合作论坛", "国际劳工组织", "七十七国集团", "巴黎俱乐部", "古阿姆民主与发展组织", "自由进步党国际", "澳新美理事会", "不结盟运动", "中欧倡议国组织", "葡语国家共同体", "核供应国集团", "社会党国际", "南美国家共同体", "加勒比国家联盟", "国际刑事法院", "英联邦", "前政府首脑国际行动理事会", "伊斯兰会议组织", "国际刑警组织", "大赦国际", "联合国协会世界联合会", "海湾合作委员会", "亚洲议会论坛", "巴统", "政府间移民委员会", "维谢格拉德集团", "各国议会联盟", "非　统(非洲统一组织)", "波罗的海国家理事会", "南亚区域合作联盟", "欧洲委员会", "华约(华沙条约组织)", "禁止化学武器组织", "亚洲议会和平协会", "桑戈委员会", "北约(北大西洋公约组织)", "伊比利亚美洲国家首脑会议", "国际移民组织", "里约集团", "东盟(东南亚国家联盟)", "法语国家组织", "美洲国家组织", "欧安组织", "非盟", "阿拉伯马格里布联盟", "拉丁美洲议会", "西欧联盟", "阿盟", "阿拉伯议会联盟", "上海合作组织", "独联体(独立国家联合体)", "欧盟(欧洲联盟)"]
    },{
        topcategory:"机构团体",
        subcategory:"工商税务机构",
        reclassify:"",
        rules:["国家工商行政管理总局", "××工商局", "××工商分局", "××工商所", "××工商工作站", "××执法检查队", "××工商行政管理局经济检查大队", "××经检大队", "××市场巡查大队", "××国税局办税服务厅", "××国家税务局", "××国家税务局稽查局", "××国家税务局××税务所", "××地方税务局", "××地方税务局稽查局", "××地方税务局××分局", "××地方税务局××税务所", "××地方税务局办税服务厅", "××办税服务厅", "××工会委员会", "××纳税申报大厅", "××农税所", "××地方税务总支委员会"]
    },{
        topcategory:"机构团体",
        subcategory:"政府机关",
        reclassify:"",
        rules:["××经济开发区管委会", "××市场管委会", "××科技园区××管委会","外交部", "公安部", "工业和信息化部", "文化部", "农业部", "国家人口和计划生育委员会", "住房和城乡建设部", "交通运输部", "国土资源部", "铁道部", "商务部", "科学技术部", "民政部", "教育部", "人力资源和社会保障部", "财政部", "国家发展和改革委员会", "司法部", "水利部", "国家民族事务委员会", "卫生部", "环境保护部", "监察部", "审计署", "国家税务总局", "中国民用航空局", "国家体育总局", "国家宗教事务局", "国务院参事室", "国务院机关事务管理局", "国家旅游局", "国家统计局", "国家林业局", "国家新闻出版总署", "国家版权局", "国家食品药品监督管理局", "国家安全生产监督管理总局", "国家煤矿安全监察局", "国家质量监督检验检疫总局", "海关总署", "国家知识产权局", "国家预防腐败局", "国务院国资委", "国务院侨务办公室", "国务院港澳事务办公室","国务院台湾事务办公室", "国务院法制办公室", "中国科学院", "中国社会科学院", "中国工程院", "国务院发展研究中心", "国家行政学院", "中国地震局", "中国气象局", "中国证券监督管理委员会", "中国保险监督管理委员会", "电力监管委员会", "全国社会保障基金理事会", "国家自然科学基金委员会", "国家测绘局", "国家海洋局", "国家档案局", "国家信访局", "国家粮食局", "国家文物局", "国家邮政局", "国家烟草专卖局", "国家外汇管理局", "国家外国专家局", "国家中医药管理局", "国家广播电影电视总局", "国务院研究室", "国务院新闻办公室", "国家能源局", "国家公务员局", "国家密码管理局", "国家原子能机构局", "国家语言文字工作委员会","全国人大常委委员会", "中共党中央委员会", "中国人民政治协商会议全国委员会", "中华人民共和国国务院","中共××省委员会", "××省人大", "××省政协", "××省人民政府", "××省公安厅", "××省工业和信息化委员会", "××省文化厅", "××省农业厅", "××省人口和计划生育委员会", "××省住房和城乡建设厅(建设厅)", "××省交通运输厅", "××省国土资源厅", "××省商务厅", "××省科学技术厅", "××省民政厅", "××省教育厅", "××省人力资源和社会保障厅", "××省财政厅", "××省发展和改革委员会", "××省水利厅", "××省民族事务委员会", "××省卫生厅", "××省环境保护厅", "××省监察厅", "××省审计厅", "××省体育局(委员会)", "××省民族宗教事务厅(委员会)", "××省政府参事室", "××省直机关事务管理局", "××省旅游局", "××省统计局", "××省林业厅(局)", "××省新闻出版局", "××省版权局", "××省食品药品监督管理局", "××省安全生产监督管理局", "××省煤矿安全监察厅(局)", "××省质量监督检验检疫总厅(局)", "××(省)海关", "××省知识产权局", "××省国有资产监督(管理)委员会", "××省人民政府侨务办公室", "××省人民政府法制办公室", "××省地震局", "××省气象局", "××省电力局(公司)", "××省社会保障局(中心)", "××省自然科学基金委员会", "××省测绘局", "××省海洋局(厅)", "××省档案局", "××省信访局", "××省粮食局", "××省文物局", "××省邮政局", "××省烟草专卖局", "××省外汇管理局", "××省外国专家局", "××省中医药(管理)局", "××省广播电影电视局", "××省人民政府研究室", "××省人民政府新闻办公室", "××省能源局", "××省公务员局", "××省农业机械事业局", "××省中小企业局", "××省畜牧食品局", "××省招商引资局", "××省机械设备成套局", "××省地质矿产勘查局", "××省煤田地质局", "××省冶金地质局", "××省专用通信局", "××省地方志编纂委员会", "××省文史研究馆", "××省博览事务局", "××省物价局", "××省监狱管理局", "××省扶贫移民局", "××省机构编制委员会办公室", "××省重点公路建设指挥部", "××省动物卫生监督所", "新疆生产建设兵团","中共××市委员会", "××市人大", "××市政协", "××市人民政府", "××市人民政府办公厅", "××市文化局", "××市农业局(委员会)", "××市人口和计划生育委员会", "××市人口和计划生育局", "××市住房和城乡建设局", "××市城乡建设委员会", "××市交通局(委员会)", "××市国土资源局", "××市国土资源与房屋管理局", "××市商务局", "××市科学技术局", "××市民政局", "××市教育局", "××市人力资源和社会保障局", "××市人事局", "××市财政局", "××市发展和改革委员会", "××市水利(务)局", "××市民族事务委员会", "××市卫生局", "××市环境保护局", "××市监察局", "××市审计局", "××市体育局(委员会)", "××市民族宗教事务局(委员会)", "××市政府参事室", "××市科技和信息化局", "××市对外贸易经济合作局", "××市直机关事务管理局", "××市旅游局", "××市统计局", "××市林业局", "××市林业和园林局", "××市新闻出版局", "××市文化广电新闻出版局", "××市文化出版局", "××市版权局", "××市食品药品监督管理局", "××市安全生产监督管理局(办公室)", "××市煤矿安全监察局", "××市质量监督检验检疫管理局", "××(城市名)海关", "××市知识产权局", "××市国有资产监督(管理)委员会", "××市人民政府外事办公室", "××市人民政府侨务办公室", "××市人民政府法制办公室", "××市地震局","××市气象局", "××市电力局(公司)", "××市社会保障局", "××市自然科学基金委员会", "××市测绘局", "××市海洋局", "××市档案局", "××市信访局", "××市粮食局", "××市文物局", "××市文物管理所", "××市烟草专卖局", "××市外汇管理局", "××市外国专家局", "××市中医药(管理)局", "××市广播电影电视局", "××市人民政府研究室", "××市人民政府新闻办公室", "××市能源局(办公室)", "××市公务员局", "××市农业机械事业局", "××市中小企业局", "××市畜牧(食品)局", "××市招商引资局", "××市机械设备成套局", "××市地质矿产勘查局", "××市煤田地质局", "××市冶金地质局", "××市专用通信局", "××市地方志编纂委员会", "××市文史研究馆", "××市博览事务局", "××市物价局", "××市扶贫移民局", "××市移民局", "××市规划局", "××市乡镇企业管理局", "××市台湾事务办公室", "××市贸易促进委员会", "××市投资促进委员会", "市经济贸易委员会", "××市城市管理委员会", "××市商业贸易委员会", "××市种子管理站", "××市住房公积金管理中心", "××市质量安全监督管理站", "××市防汛抗旱指挥部", "××市交通运政管理处", "新疆生产建设兵团××师", "中共××区委员会", "××区人大", "××区政协", "××市××区人民政府", "××区人民政府办公室", "××区发展和改革委员会", "××区教育委员会", "××区科学技术委员会", "××区社会建设工作办公室", "××区监察局", "××区民政局", "××区财政局", "××区人力资源和社会保障局", "××区人事局", "××区劳动和社会保障局", "××区住房城乡建设委员会", "××区市政市容管理委员会", "××区国有资产监督管理委员会","××区农林委员会", "××区商务局", "××区商务委员会", "××区文化委员会", "××区人口和计划生育委员会", "××区审计局", "××区人民政府社会建设工作办公室", "××区环境保护局", "××区水务局", "××区政府公共服务委员", "××区环境建设指挥部办公室", "××区地区开发建设委员会办公室", "××区体育局", "××区统计局", "××区绿化局", "××区安全生产监督管理局", "××区旅游局", "××区人民政府外事办公室", "××区民族宗教侨务办公室", "××区区人民政府法制办公室", "××区信息化工作办公室","××区人民政府信访办公室", "××区民防局", "××区城市管理监督指挥中心", "××区城市管理监察大队", "××区人民政府金融(工作)办公室", "××区房屋管理局", "××区规划局", "××区行政服务中心", "××区卫生局", "××区版权局", "××区测绘局", "××区档案局", "××区地方志编纂委员会", "××区地震局", "××区老干部局", "××区气象局", "××自治县种子管理站", "××区环境保护监测站", "××区基金管理中心", "新疆生产建设兵团××师××团", "指镇级(包括镇", "乡", "区公所", "苏木", "民族乡", "民族苏木", "街道办)党委", "人大", "政协", "政府及所属的委", "办", "所等各机关单位。", "××镇人民政府", "××镇人大", "中共××镇纪律检查委员会", "××镇党政办公室", "××镇水利站", "××镇林业站", "××镇劳动和社会保障所", "××镇农业技术综合服务中心", "××镇社会综合治理办公室", "××乡计划生育办公室", "××乡宣传文化中心", "××乡农技推广站", "××镇水利站", "××乡农业技术服务站", "××镇监督委员会", "××街道办事处", "新疆生产建设兵团××师××团××农场(牧场)", "××村(民)委(员)会", "××居民委员会", "中共××村委员会", "中共××社区党支部", "××社区居民委员会", "××社区劳动保障服务站"]
    },{
        topcategory:"机构团体",
        subcategory:"社会团体",
        reclassify:"",
        rules:["伊斯兰教协会", "基督教三自爱国运动委员会", "××老年协会", "××党员之家", "××员工之家", "××科技工作者之家", "××动物学会", "××生态学会", "××植物学会", "××社区经济合作社", "××供销社", "××供销合作(联)社", "中国共产主义青年团(共青团)××委员会(团总支", "总支委员会", "支部委员会)", "××中国共产主义青年团××团支部", "××青年中心", "中国少年先锋队××委员会", "××少先大队委员会", "××少先队大队部", "××少年先锋队", "××妇女联合会", "××妇女儿童维权中心", "××妇联家庭服务处", "××妇代会", "××妇联妇女儿童服务中心", "××妇女工作委员会", "××妇联妇女儿童权益维护工作站", "××妇女维权工作站", "××残疾人联合会", "××残疾人工作委员会", "××残疾人协会", "××红十字会", "××红十字救护站", "××红十字博爱互助中心", "××红十字服务站", "××红十字工作委员会", "××消费者协会", "××消费者协会××投诉站", "××消费者协会××监督站", "××消费者维权站", "××医学会", "××商业协会", "××个体私营经济协会", "××运输协会", "××产业协会", "××医药协会", "××工商业联合会", "××科技工作者协会", "××乒乓球协会", "××台球协会", "××室内装饰协会", "××工业协会", "××企业协会", "××烹饪协会", "××美容美发协会", "××摄影协会", "××教育协会", "××音乐家协会", "××文艺家协会", "××曲艺家协会", "××舞蹈家协会", "××电影家协会", "××燃气协会", "××食品协会", "××省食品工业协会", "××中华慈善总会", "××中国扶贫基金会", "××北京地球村", "××福利院", "××孤儿院", "××残疾人福利基金会", "××慈善会", "××慈善协会", "××基金会", "××社会捐助接收工作站", "××慈善物资捐赠中心", "××妇联保育院", "××困难职工帮扶中心", "××慈善社", "××儿童村", "××博爱超市", "××基督教教务委员会", "××教会"]
    },{
        topcategory:"机构团体",
        subcategory:"文艺团体",
        reclassify:"",
        rules:["中华全国总工会文工团", "××艺术团", "××歌舞团", "××剧团", "××话剧团", "××文工团", "××艺术中心", "××民乐团", "××彝剧团", "××滇剧团", "××合唱团", "××曲艺社", "××曲艺苑", "××武术团", "××曲艺社", "××杂技团"]
    },{
        topcategory:"机构团体",
        subcategory:"科研机构",
        reclassify:"",
        rules:["中国地质科学院", "××研究所", "××设计院", "××设计研究院", "××研究室", "××地质测试中心", "××研发中心", "××设计所", "××勘察设计院", "××省社会科学院", "××省农业科学院", "中国测试技术研究院", "××分析测试学会"]
    },{
        topcategory:"购物",
        subcategory:"便利店",
        reclassify:"",
        rules:["7-ELEVEN", "全家", "WOWO便利店", "北京望京广龙便民商店", "你好生活便利店"]
    },{
        topcategory:"购物",
        subcategory:"超市",
        reclassify:"",
        rules:["北京华联超市","联华超市/世纪联华超市","家乐福超市","华润超市","沃尔玛超市","家得利超市","津工超市","农工商超市","苏果超市","中百超市(山东)","中百超市(湖北)","物美超市","华联超市/上海华联超市","互惠超市","红旗超市","好又多","卜蜂莲花(易初莲花)","惠康超市"]
    },{
        topcategory:"购物",
        subcategory:"数码家电",
        reclassify:"",
        rules:["苏宁电器","三星专卖店","国美电器","大中电器","零售业","电脑专卖店","通信器材"]
    },{
        topcategory:"购物",
        subcategory:"家具家居建材",
        reclassify:"",
        rules:["居然之家","宜家家居","集美家居","富森·美","红星美凯龙","TOTO","九牧厨卫","马可波罗瓷砖","欧普照明","水星家纺","小刘五金","佳装建材","阳光布艺","千叶墙纸"]
    },{
        topcategory:"购物",
        subcategory:"农贸市场",
        reclassify:"",
        rules:["英郡便民菜市场","西区水果批发市场","如意海鲜批发","天丰利市场(和平里店)","鸿发粮行","方记干杂调料经营部","天天鲜水果店","望锦炒货","金华金调味品","粮油干杂副食"]
    },{
        topcategory:"购物",
        subcategory:"小商品市场",
        reclassify:"",
        rules:["五棵松大集","染房街小商品天地","西南酒店用品批发商城","义乌小商品直销超市"]
    },{
        topcategory:"购物",
        subcategory:"旧货市场",
        reclassify:"",
        rules:["潘家园旧货市场","飞新马二手城","顾册旧货市场"]
    },{
        topcategory:"购物",
        subcategory:"体育户外",
        reclassify:"",
        rules:["中国冰上运动器材专卖店","迪卡侬","思凯乐户外生活馆","××户外用品","汇友渔具","探路者户外用品","快乐渔人渔具钓具"]
    },{
        topcategory:"购物",
        subcategory:"服饰鞋包",
        reclassify:"",
        rules:["阿桑娜","班尼路","森马","罗宾汉","生活几何","ZARA","九牧王","梦特娇","红蜻蜓","达芙妮","富贵鸟","森达","索菲亚","奥康","斯图加","稻草人","食草堂"]
    },{
        topcategory:"购物",
        subcategory:"图书音像",
        reclassify:"",
        rules:["西西弗书店","大世界音像","影视林音像店"]
    },{
        topcategory:"购物",
        subcategory:"眼镜店",
        reclassify:"",
        rules:["宝岛眼镜","犀牛视光中心","名镜佳视验光配镜中心"]
    },{
        topcategory:"购物",
        subcategory:"母婴儿童",
        reclassify:"",
        rules:["好孩子(当代商城店)","蓝旗亲子游泳","马博士婴儿游泳馆"]
    },{
        topcategory:"购物",
        subcategory:"珠宝饰品",
        reclassify:"",
        rules:["周大福", "周生生", "卡地亚", "蒂芬尼", "××珠宝店", "××珠宝行", "××首饰店", "石头记", "哎呀呀", "七色花饰品店", "至吾爱饰品店"]
    },{
        topcategory:"购物",
        subcategory:"礼品",
        reclassify:"",
        rules:["熊猫邮局", "谭木匠", "zippo", "名创优品", "××礼品店", "××工艺品店", "魔镜·杂货铺"]
    },{
        topcategory:"生活服务",
        subcategory:"彩票",
        reclassify:"彩票彩券销售点",
        rules:["中国福利彩票", "中国体育彩票", "××彩票"]
    },{
        topcategory:"生活服务",
        subcategory:"彩票",
        reclassify:"马会投注站",
        rules:["赛马会"]
    },{
        topcategory:"生活服务",
        subcategory:"家政",
        reclassify:"月嫂保姆",
        rules:["禧月阁月子中心", "爱妈妈月嫂", "爱宝贝母婴护理中心"]
    },{
        topcategory:"生活服务",
        subcategory:"家政",
        reclassify:"保洁钟点工",
        rules:["金圣鹰家政保洁服务中心", "深圳帮手清洁有限公司"]
    },{
        topcategory:"生活服务",
        subcategory:"家政",
        reclassify:"开锁",
        rules:["开锁换锁公司"]
    },{
        topcategory:"生活服务",
        subcategory:"中介机构",
        reclassify:"",
        rules:["我家我家","链家地产","易合房产","牵缘阁婚介所", "一华诚信工商代理", "北京天平专利商标代理有限公司", "东方鑫泰商务注标册代理公司", "美日保险代理", "北京新亚融智国际商务咨询公司"]
    },{
        topcategory:"生活服务",
        subcategory:"婚庆服务",
        reclassify:"",
        rules:["××婚庆服务一条龙", "SHINEMODA高级婚纱定制", "六月嫁期婚礼策划", "百年好合国际婚纱摄影", "小时代婚礼美学"]
    },{
        topcategory:"娱乐休闲",
        subcategory:"洗浴推拿足疗",
        reclassify:"",
        rules:["权金城", "康乐宫"]
    },{
        topcategory:"娱乐休闲",
        subcategory:"KTV",
        reclassify:"",
        rules:["麦乐迪KTV"]
    },{
        topcategory:"娱乐休闲",
        subcategory:"酒吧",
        reclassify:"",
        rules:["Rainbow酒吧 "]
    },{
        topcategory:"娱乐休闲",
        subcategory:"咖啡厅",
        reclassify:"",
        rules:["上岛咖啡", "两岸咖啡", "啡常品咖啡", "欧索米萝咖啡", "铃木咖啡馆", "百世德咖啡", "新岛咖啡", "雕刻时光", "蓝山咖啡馆", "迪欧咖啡", "歌顿咖啡", "Pacific Coffee Company"]
    },{
        topcategory:"娱乐休闲",
        subcategory:"夜总会",
        reclassify:"",
        rules:["歌舞厅", "夜总会", "部分不代表饭店的会馆", "部分俱乐部"]
    },{
        topcategory:"娱乐休闲",
        subcategory:"茶馆",
        reclassify:"",
        rules:["闲友茶屋"]
    },{
        topcategory:"娱乐休闲",
        subcategory:"电影院",
        reclassify:"",
        rules:["中影国际影城(永旺店)"]
    },{
        topcategory:"娱乐休闲",
        subcategory:"度假疗养",
        reclassify:"",
        rules:["四川革命伤残军人疗养院", "崇州凤鸣山康复养生院", "武钢青城山疗养院"]
    },{
        topcategory:"娱乐休闲",
        subcategory:"户外活动",
        reclassify:"游乐场",
        rules:["欢乐谷"]
    },{
        topcategory:"娱乐休闲",
        subcategory:"户外活动",
        reclassify:"拓展培训",
        rules:["峰谷岛野外拓展培训","极限蹦极塔","九九勇士CS","极限攀岩"]
    },{
        topcategory:"运动健身",
        subcategory:"舞蹈",
        reclassify:"",
        rules: ["××舞蹈工作室", "火上芭蕾", "爱双月肚皮舞培训中心", "亚亚钢管舞", "菲比街舞", "馨艺舞蹈"]
    },{
        topcategory:"酒店宾馆",
        subcategory:"酒店宾馆",
        reclassify:"",
        rules: ["星美酒店"]
    },{
        topcategory:"酒店宾馆",
        subcategory:"星级酒店",
        reclassify:"",
        rules: ["翠宫饭店(知春路店)"]
    },{
        topcategory:"酒店宾馆",
        subcategory:"经济型酒店",
        reclassify:"",
        rules: ["7天连锁酒店(右安门店)","如家快捷酒店","汉庭连锁酒店"]
    },{
        topcategory:"酒店宾馆",
        subcategory:"公寓式酒店",
        reclassify:"",
        rules: ["北京东管丽泽公寓","××求职公寓","××短租公寓"]
    },{
        topcategory:"酒店宾馆",
        subcategory:"旅馆招待所",
        reclassify:"",
        rules: ["众晶鑫酒店招待所"]
    },{
        topcategory:"酒店宾馆",
        subcategory:"度假村",
        reclassify:"",
        rules: ["××山庄","××温泉度假村","××度假村","龙脉温泉度假村"]
    },{
        topcategory:"酒店宾馆",
        subcategory:"农家院",
        reclassify:"",
        rules: ["山乡农家院"]
    },{
        topcategory:"酒店宾馆",
        subcategory:"青年旅社",
        reclassify:"",
        rules: ["珠穆朗玛青年旅社","瓦当青年旅舍","栖游青年旅馆"]
    },{
        topcategory:"旅游景点",
        subcategory:"城市广场",
        reclassify:"",
        rules: ["天府广场"]
    },{
        topcategory:"旅游景点",
        subcategory:"世界遗产",
        reclassify:"",
        rules: ["长城", "北京故宫", "北京颐和园", "北京天坛", "敦煌莫高窟", "秦始皇陵及兵马俑", "周口店北京猿人遗址", "承德避暑山庄及周围寺庙", "孔府", "孔庙", "孔林", "武当山古建筑群", "西藏布达拉宫", "丽江古城", "平遥古城", "苏州古典园林", "明清皇家陵寝", "澳门历史城区", "龙门石窟", "安阳殷墟", "大足石刻", "都江堰-青城山", "皖南古村落-西递宏村", "山西云冈石窟", "高句丽王城", "王陵及贵族墓葬", "开平碉楼与村落", "福建土楼", "武陵源风景名胜区", "九寨沟风景名胜区", "黄龙风景名胜区", "大熊猫栖息地", "中国南方喀斯特地貌", "三清山风景名胜区", "泰山风景名胜区", "黄山风景名胜区", "峨眉山-乐山大佛", "武夷山", "庐山风景名胜区", "五台山"]
    },{
        topcategory:"旅游景点",
        subcategory:"寺庙道观",
        reclassify:"",
        rules: ["福国寺", "灵山寺", "五塔寺"]
    },{
        topcategory:"银行金融",
        subcategory:"银行",
        reclassify:"",
        rules: ["中国人民银行", "国家开发银行", "中国进出口银行", "中国银行", "中国工商银行", "中国建设银行", "中国农业银行", "交通银行", "招商银行", "华夏银行", "中信银行", "中国民生银行", "中国光大银行", "上海银行", "上海浦东发展银行", "深圳发展银行", "深圳平安银行", "兴业银行", "北京银行", "广东发展银行", "农村商业银行", "香港恒生银行", "东亚银行", "花旗银行", "渣打银行", "汇丰银行 ", "荷兰银行", "美国运通银行", "瑞士友邦银行", "美国银行", "蒙特利尔银行", "纽约银行", "苏格兰皇家银行", "法国兴业银行", "德意志银行", "日本三菱东京日联银行", "巴克莱银行", "摩根大通银行", "中国邮政储蓄银行", "香港星展银行", "南洋商业银行", "上海商业银行", "永亨银行", "香港永隆银行", "创兴银行", "大新银行", "中信银行国际", "大众银行(香港)"]
    },{
        topcategory:"银行金融",
        subcategory:"自动提款机",
        reclassify:"",
        rules: ["中国银行ATM", "中国工商银行ATM", "中国建设银行ATM", "中国农业银行ATM", "交通银行ATM", "招商银行ATM", "华夏银行ATM", "中信银行ATM", "中国民生银行ATM", "中国光大银行ATM", "上海银行ATM", "上海浦东发展银行ATM", "深圳发展银行ATM", "深圳平安银行ATM", "兴业银行ATM", "北京银行ATM", "广东发展银行ATM", "农村商业银行ATM", "香港恒生银行ATM", "东亚银行ATM", "花旗银行ATM", "渣打银行ATM", "汇丰银行ATM", "荷兰银行ATM", "美国运通银行ATM", "瑞士友邦银行ATM", "美国银行ATM", "蒙特利尔银行ATM", "纽约银行ATM", "苏格兰皇家银行ATM", "法国兴业银行ATM", "德意志银行ATM", "日本三菱东京日联银行ATM", "巴克莱银行ATM", "摩根大通银行ATM", "中国邮政储蓄银行ATM", "香港星展银行 ATM", "南洋商业银行 ATM", "上海商业银行 ATM", "永亨银行 ATM", "香港永隆银行 ATM", "创兴银行 ATM", "大新银行 ATM", "中信银行国际 ATM", "大众银行(香港) ATM"]
    },{
        topcategory:"银行金融",
        subcategory:"保险公司",
        reclassify:"",
        rules:["中国大地财产保险股份有限公司", "天安保险股份有限公司", "××保险公司××查勘服务点", "××保险股份有限公司××服务点", "××财产保险股份公司××业务代办点", "××保险股份有限公司××营销服务部", "××保险××营业部", "××保险经纪公司", "云南空港保险代理有限公司", "××财产保险股份有限公司××业务咨询点", "吉林油田社会保险中心第四保险所", "中国共产党扶余县社会保险公司委员会", "××保险股份有限公司××工作站", "众鑫汽车保险代理", "四川诚品保险代理有限公司崇州分公司", "攀枝花市东区医保中心", "宣汉县华景乡保险服务站", "中华保险拆检中心", "天安保险股份有限公司交运汽修定点拆检维修中心", "天安保险事故车拆检中心", "原平市机关事业社会保险所", "大东沟财产保险所", "泽州县农村社会养老保险事务所", "中华保险定损中心", "广州汇信保险公估有限公司"]
    },{
        topcategory:"银行金融",
        subcategory:"证券公司",
        reclassify:"",
        rules:["××证券有限责任公司", "××证券股份有限公司", "××证券", "××证券有限责任公司××区服务部", "吉林金昌期货经济有限责任公司", "华西证券华蓥网上交易技术服务站", "君安证券有限公司成都办事处", "国泰君安证券公司管理室", "金鼎综合证券(香港)有限公司成都代表处", "华西证券网上交易大竹技术服务站", "华安证券有限责任公司国债基金专柜", "济南信息期货证券市场", "广东证券公司三水管理处", "长城伟业期货经纪有限公司", "苏物期货扬州营业部", "徐州新纪元期货金湖地区业务总代理", "海通证券江夏网上客户服务中心", "金邦得债券业务中心", "亚洲证券有限公司破产管理人"]
    },{
        topcategory:"银行金融",
        subcategory:"财务公司",
        reclassify:"",
        rules:["亚洲联合财务", "××财务××分行", "××财务有限公司××分行", "匯基理财有限公司", "××财务有限公司", "盛百利财务顾问有限公司", "迅达财务私人代款"]
    },{
        topcategory:"地名地址",
        subcategory:"地名地址信息",
        reclassify:"",
        rules:["中关村", "王府井"]
    },{
        topcategory:"地名地址",
        subcategory:"自然地名",
        reclassify:"山",
        rules:["香山"]
    },{
        topcategory:"地名地址",
        subcategory:"自然地名",
        reclassify:"海湾海峡",
        rules:["渤海湾"]
    },{
        topcategory:"房产小区",
        subcategory:"产业园区",
        reclassify:"",
        rules:["××科技园", "××创业园", "××工业园", "××软件园", "××产业基地", "××科技示范园", "××产业开发区", "××经济园区", "××工业区", "××经济技术开发区", "××高新技术产业开发区", "××保税区", "××创业中心", "××产业园", "××工业中心(非大厦类)", "××工业城", "××物流园"]
    },{
        topcategory:"房产小区",
        subcategory:"住宅区",
        reclassify:"宿舍",
        rules:["××学生公寓", "××宿舍区", "××宿舍", "××职工宿舍"]
    },{
        topcategory:"房产小区",
        subcategory:"住宅区",
        reclassify:"别墅",
        rules:["××别墅", "××山庄", "××庄园"]
    },{
        topcategory:"房产小区",
        subcategory:"住宅区",
        reclassify:"住宅小区",
        rules:["××小区", "××花园", "××住宅区"]
    },{
        topcategory:"基础设施",
        subcategory:"道路附属",
        reclassify:"桥",
        rules:["××桥"]
    },{
        topcategory:"基础设施",
        subcategory:"道路附属",
        reclassify:"路口",
        rules:["××路口"]
    },{
        topcategory:"基础设施",
        subcategory:"道路附属",
        reclassify:"道路出入口",
        rules:["××路出入口"]
    },{
        topcategory:"基础设施",
        subcategory:"道路附属",
        reclassify:"服务区",
        rules:["××服务区","高速停车区"]
    },{
        topcategory:"基础设施",
        subcategory:"道路附属",
        reclassify:"收费站",
        rules:["××收费站"]
    },{
        topcategory:"基础设施",
        subcategory:"公共设施",
        reclassify:"紧急避难场所",
        rules:["××灾民避难所", "××自然灾害临时庇护中心", "××避灾中心", "××避灾点", "××应急掩蔽场所", "××临时避难场所"]
    },{
        topcategory:"基础设施",
        subcategory:"交通设施",
        reclassify:"飞机场",
        rules:["××机场", "××航站楼", "××候机楼(机场内的候机楼)"]
    },{
        topcategory:"基础设施",
        subcategory:"交通设施",
        reclassify:"长途汽车站",
        rules:["××客运站", "××汽车站", "××客运中心站", "××客运", "××车站", "××站", "××客运中心"]
    },{
        topcategory:"基础设施",
        subcategory:"交通设施",
        reclassify:"港口码头",
        rules:["××码头", "××港", "××渡口", "××港口", "××门", "××轮渡站", "××轮渡", "××渡", "××客运站", "××閘口", "××候船室"]
    },{
        topcategory:"地名地址",
        subcategory:"门牌信息",
        reclassify:"",
        rules:["××村××号"]
    },{
        topcategory:"地名地址",
        subcategory:"行政地名",
        reclassify:"",
        rules:["××村","××镇"]
    },{
        topcategory:"地名地址",
        subcategory:"自然地名",
        reclassify:"湖泊",
        rules:["××湖"]
    },{
        topcategory:"地名地址",
        subcategory:"自然地名",
        reclassify:"河流",
        rules:["××河"]
    },{
        topcategory:"地名地址",
        subcategory:"自然地名",
        reclassify:"岛屿",
        rules:["××岛"]
    },{
        topcategory:"地名地址",
        subcategory:"道路名",
        reclassify:"",
        rules:["××路"]
    },{
        topcategory:"地名地址",
        subcategory:"交通地名",
        reclassify:"",
        rules:["××立交"]
    },{
        topcategory:"教育学校",
        subcategory:"成人教育",
        reclassify:"",
        rules:["××职工大学", "××广播电视大学", "××管理干部学校", "××教育学院", "××业余大学", "××夜大", "××成人中专学校", "××教师进修学校", "××成人教育学院", "××函授学院(站)", "××老年大学", "××妇女干部学院", "××成教中心", "××老干部大学", "××社区大学", "××继续教育学院", "××成人学校", "××业余大学"]
    },{
        topcategory:"教育学校",
        subcategory:"职业技术学校",
        reclassify:"",
        rules:["××技术学校", "××卫生学校", "××职业学校", "××中等专业学校", "××技工学校", "××烹饪学校", "××技术专修学校", "××艺术学校", "××财经学校", "体育学校", "职高"]
    },{
        topcategory:"教育学校",
        subcategory:"培训",
        reclassify:"",
        rules:["××农民学校", "××夜校", "××培训学校", "××培训中心", "××培训办公室", "××孕妇学校", "××培训部", "××辅导中心", "英孚教育", "华尔街英语", "博美画室"]
    },{
        topcategory:"教育学校",
        subcategory:"幼儿园",
        reclassify:"",
        rules:["××幼儿园", "××托儿所", "××亲子园", "××幼儿班", "××学前班", "××托辅中心", "××托管中心", "××幼稚园"]
    },{
        topcategory:"教育学校",
        subcategory:"中学",
        reclassify:"",
        rules:["××中学", "××实验学校", "××附属中学"]
    },{
        topcategory:"文化场馆",
        subcategory:"会展中心",
        reclassify:"",
        rules:["××会展中心"]
    },{
        topcategory:"文化场馆",
        subcategory:"美术馆",
        reclassify:"",
        rules: ["××美术馆", "××美术中心", "××美术社", "××画院"]
    },{
        topcategory:"文化场馆",
        subcategory:"文化宫",
        reclassify:"",
        rules:["××民族文化宫", "××工人文化宫", "××文化宫", "××文化馆", "××青少年宫", "××少年宫", "××青少年活动中心", "××文化站", "××文化艺术中心", "××文化活动中心"]
    },{
        topcategory:"文化场馆",
        subcategory:"档案馆",
        reclassify:"",
        rules:["××档案馆(局)", "××档案资料馆", "××档案室", "××档案管理中心", "××现行文件查阅中心", "××档案寄存中心"]
    },{
        topcategory:"文化场馆",
        subcategory:"天文馆",
        reclassify:"",
        rules:["××天文台", "××观象台", "××天文馆", "××天象厅", "××天文观测馆"]
    },{
        topcategory:"文化场馆",
        subcategory:"图书馆",
        reclassify:"",
        rules:["××图书馆", "××阅览室", "××图书资料室", "××图书室", "××阅览中心"]
    },{
        topcategory:"文化场馆",
        subcategory:"科技馆",
        reclassify:"",
        rules:["××科技馆", "××科技中心", "××科学技术馆", "××科普馆", "××科学馆", "××科学宫", "××科技信息馆", "××科普展厅"]
    },{
        topcategory:"文化场馆",
        subcategory:"展览馆",
        reclassify:"",
        rules:["××陈列室", "××展览馆", "××展览中心", "××诗歌馆", "××雕塑艺术馆", "××艺术馆", "××收藏馆", "××奇石馆", "××标本馆", "××民俗馆", "××展示中心", "××书法作品展", "××群众艺术馆", "××汇展中心", "××展示馆", "××博览园"]
    },{
        topcategory:"文化场馆",
        subcategory:"博物馆",
        reclassify:"",
        rules: ["××博物馆", "××博物院"]
    },{
        topcategory:"旅游景点",
        subcategory:"海滩",
        reclassify:"",
        rules: ["××沙滩", "××海滩"]
    },{
        topcategory:"旅游景点",
        subcategory:"纪念馆",
        reclassify:"",
        rules:["××纪念碑", "××纪念馆", "××故园", "××故居"]
    },{
        topcategory:"旅游景点",
        subcategory:"水族馆",
        reclassify:"",
        rules:["××水族馆", "××海洋馆"]
    },{
        topcategory:"旅游景点",
        subcategory:"动物园",
        reclassify:"",
        rules:["××动物园"]
    },{
        topcategory:"旅游景点",
        subcategory:"植物园",
        reclassify:"",
        rules:["××植物园"]
    },{
        topcategory:"旅游景点",
        subcategory:"风景名胜",
        reclassify:"",
        rules:["××旧址"]
    },{
        topcategory:"医疗保健",
        subcategory:"疾病预防",
        reclassify:"",
        rules:["××疾病预防控制中心", "××卫生防疫站", "××卫生防疫中心", "××预防控制中心", "××预防保健中心", "××结核病防治所"]
    },{
        topcategory:"医疗保健",
        subcategory:"药房药店",
        reclassify:"",
        rules: ["××草药店", "××药房", "××中西药门市", "××药行", "××药堂", "××药材店", "××药材收购站"]
    },{
        topcategory:"医疗保健",
        subcategory:"急救中心",
        reclassify:"",
        rules:["××急救中心", "××120急救中心", "××紧急救援中心", "××急救站", "××孕产妇抢救中心", "××医疗救护中心"]
    },{
        topcategory:"医疗保健",
        subcategory:"诊所",
        reclassify:"",
        rules:["××诊所", "××门诊", "××卫生所", "××卫生室", "××门诊部", "××医务室", "××卫生站", "××正骨诊所", "××医务所"]
    },{
        topcategory:"医疗保健",
        subcategory:"专科医院",
        reclassify:"精神病医院",
        rules:["××精神病医院", "××精神病防治康复医院", "××精神卫生防治医院", "××精神卫生中心", "××精神病防治院", "××精神病防治康复技术指导中心", "××精神病防治所"]
    },{
        topcategory:"医疗保健",
        subcategory:"专科医院",
        reclassify:"传染病医院",
        rules: ["××传染病医院", "××结核病医院", "××肝炎病防治中心", "××性病艾滋病检测中心", "××乙肝专科治疗中心"]
    },{
        topcategory:"医疗保健",
        subcategory:"专科医院",
        reclassify:"儿科",
        rules: ["××儿童医院"]
    },{
        topcategory:"医疗保健",
        subcategory:"专科医院",
        reclassify:"妇产科",
        rules:["××妇科专科", "××妇产专科医院", "××妇科医院", "××女子医院", "××妇科疾病治疗中心"]
    },{
        topcategory:"医疗保健",
        subcategory:"专科医院",
        reclassify:"脑科",
        rules:["××脑科医院", "××心脑血管病医院", "××脑瘫疗育中心", "××脑病医院", "××癫痫脑病医院", "××脑瘫康复医院"]
    },{
        topcategory:"医疗保健",
        subcategory:"专科医院",
        reclassify:"肿瘤",
        rules:["××肿瘤医院", "××肿瘤防治院", "××肿瘤防治中心", "××肿瘤化疗中心", "××肿瘤诊疗中心"]
    }, {
        topcategory: "医疗保健",
        subcategory: "专科医院",
        reclassify: "骨科",
        rules: ["××骨科医院", "××骨科", "××骨质增生专科", "××正骨医院", "××骨腔医院", "××整骨医院", "××脊柱梳理中心", "××脊髓病医院", "××骨伤医院", "××骨质增生专科医院", "××骨伤康复医院", "××骨关节病医院", "××风湿骨病医院", "××股骨头坏死专科医院", "××创伤外骨科诊疗中心"]
    },{
        topcategory: "医疗保健",
        subcategory: "专科医院",
        reclassify: "胸科",
        rules: ["××医院胸外科", "××胸科医院", "××肺科医院", "××心脑血管病治疗专科"]
    },{
        topcategory: "医疗保健",
        subcategory: "专科医院",
        reclassify: "耳鼻喉",
        rules: ["××耳鼻喉医院", "××气管炎哮喘医院", "××甲状腺疾病专科", "××哮喘医院", "××喉科医院", "××耳鼻喉治疗中心", "××耳聋医院", "××听力语言康复中心", "××甲状腺疾病专科"]
    },{
        topcategory: "医疗保健",
        subcategory: "专科医院",
        reclassify: "眼科",
        rules: ["××近视弱视矫正中心", "××白内障康复中心", "××眼科医院", "××眼病防治中心", "××眼科门诊部", "××眼科中心", "××近视眼防治院"]
    },{
        topcategory: "医疗保健",
        subcategory: "专科医院",
        reclassify: "整形",
        rules:["××整形美容医院", "××洗牙美牙店", "××整形减肥中心", "××烧伤治疗中心", "××美容整形专科医院", "××烧伤整形中心", "××美容中心", "××美容医院", "××整形外科医院", "××整容中心", "××激光美容专科"]
    },{
        topcategory: "医疗保健",
        subcategory: "专科医院",
        reclassify: "齿科",
        rules:["××口腔医院", "××牙病防治院", "××口腔正畸中心", "××口腔病防治所", "××齿科医院", "××儿童牙病治疗中心", "××牙防中心", "××牙科诊所", "××补牙诊所", "××口腔门诊"]
    },{
        topcategory: "医疗保健",
        subcategory: "综合医院",
        reclassify: "",
        rules:["××人民医院", "××县人民医院", "××中医院", "××红十字会医院", "××中西医结合医院", "××镇医院"]
    },
    {
        topcategory: "机构团体",
        subcategory: "公检法机构",
        reclassify: "",
        rules: ["××司法局", "××司法所", "××司法厅", "××司法局委员会", "××司法站", "××派出所", "××公安局", "××公安局警务站", "××公安部", "××公安厅", "××警务室", "××警务工作站", "××公安局防范和打击涉电违法犯罪分中心", "××警务亭", "××公安局委员会", "××反贪污贿赂局", "××反渎职侵权局", "××举报中心", "××检察院", "××检察院举报中心", "××检察院犯罪案件举报中心", "××人民检察院委员会", "××法院", "××法庭", "××人民法院司法警察大队", "××人民法院执行工作局", "××人民法院执行局", "××人民法院诉讼接待中心", "××法院法警支队", "××消防总局", "××消防局", "××消防支队", "××消防大队", "××消防中队", "××消防工作室", "××消防支队特勤中队", "××消防岗亭", "××消防科", "××森林防火指挥部", "××社区巡防队", "××治安联防队", "××社区保安队", "××治安岗亭", "××保卫处", "××治安执勤点", "××治安巡防大队", "××保安部", "××社区房屋租赁(治安)管理站", "××社区房屋租赁(外来人员)管理登记站", "××派出所(警察署)××房屋租赁治安管理站", "××居住房屋租赁事务服务点", "××房屋租赁管理服务处"]
    }, {
        topcategory: "机构团体",
        subcategory: "传媒机构",
        reclassify: "",
        rules: ["××小记者站", "××广播电视服务部", "××传媒中心", "××译制中心", "××广播站", "××文化传播公司", "××广播电视公司", "××录音工作室", "××影视传媒", "××编辑部", "××新闻中心", "××(广播)电视中心", "新华社", "电视台", "电台", "报社", "杂志社", "出版社"]
    }, {
        topcategory: "机构团体",
        subcategory: "文艺团体",
        reclassify: "",
        rules: ["中华全国总工会文工团", "××艺术团", "××歌舞团", "××剧团", "××话剧团", "××文工团", "××艺术中心", "××民乐团", "××彝剧团", "××滇剧团", "××合唱团", "××曲艺社", "××曲艺苑", "××武术团", "××曲艺社", "××杂技团"]
    }, {
        topcategory: "机构团体",
        subcategory: "科研机构",
        reclassify: "",
        rules: ["中国地质科学院", "××研究所", "××设计院", "××设计研究院", "××研究室", "××地质测试中心", "××研发中心", "××设计所", "××勘察设计院", "××省社会科学院", "××省农业科学院", "中国测试技术研究院", "××分析测试学会"]
    }, {
        topcategory: "机构团体",
        subcategory: "机构团体附属",
        reclassify: "",
        rules: ["××团体委员会", "××团体办公室"]
    }, {
        topcategory: "购物",
        subcategory: "综合商场",
        reclassify: "",
        rules: ["××商场"]
    }, {
        topcategory: "购物",
        subcategory: "花鸟鱼虫",
        reclassify: "",
        rules: ["为爱花艺", "春天花坊", "××花鸟市场", "××花鸟店", "××鸟市", "花鸟虫鱼店", "陶艺华冠花卉花鸟虫鱼", "××水族店", "××水族馆", "××水族商行"]
    }, {
        topcategory: "购物",
        subcategory: "商业步行街",
        reclassify: "",
        rules: ["××步行街"]
    }, {
        topcategory: "购物",
        subcategory: "摄影器材",
        reclassify: "",
        rules: ["××摄影器材店", "××(品牌照相机或摄像机)专卖店"]
    }, {
        topcategory: "购物",
        subcategory: "化妆品",
        reclassify: "",
        rules: ["屈臣氏", "欧莱雅", "莎莎", "za", "兰芝", "自然堂", "雅诗兰黛", "金甲虫化妆品连锁店", "××化妆品", "××化妆品行", "××化妆屋", "××化妆品店", "××化妆行", "××化妆品总汇", "××化妆品专卖店", "××化妆精品", "××化妆品商行", "××化妆品经营部", "××化妆品销售", "××化妆店", "××彩妆商行", "××名妆", "××美容美发用品商行", "××化妆品饰品", "××个人美护用品", "××化妆品专卖", "××化妆品超市 ", "××品牌化妆品", "××化妆品淘宝店", "××美容美发用品", "××化妆名品店", "××个人用品店", "××化妆品百货", "××化妆品折扣店", "××艾芦世界", "艾丽××", "××化妆品连锁专营店", "××化妆品××", "××个人用品专卖店", "安利", "××化妆城", "××日用品商店", "××美发用品", "××日用品商行", "××日化", "××护肤品", "××护理用品店", "××美容用品", "××日用品", "××洗化饰品店", "××美容美发精品", "××化妆店", "××日用百货商行", "××个人护理专卖", "××美妆连锁店××洗化", "××洗化精品城"]
    }, {
        topcategory: "购物",
        subcategory: "拍卖典当行",
        reclassify: "",
        rules: ["××拍卖行", "××拍卖有限责任公司", "××拍卖商行","××典当行", "××典当有限公司", "××典当", "××典当行有限公司", "××典当有限责任公司", "××典当商行", "××当铺", "××典当公司", "××典当行有限责任公司", "××大押"]
    }, {
        topcategory: "购物",
        subcategory: "古玩字画",
        reclassify: "",
        rules: ["××古玩", "××字画古玩店", "××古董店"]
    }, {
        topcategory: "购物",
        subcategory: "自行车专卖",
        reclassify: "",
        rules: ["捷安特专卖店", "上海永久自行车专卖", "雅迪(转塘专卖店)", "绿源电动车", "电动三轮车", "××车行", "××自行车配件行", "××电动车", "××电动车配件行", "××自行车商店"]
    }, {
        topcategory: "购物",
        subcategory: "烟酒专卖",
        reclassify: "",
        rules: ["××名烟名酒超市", "××烟店", "××烟酒商店", "××名烟名酒批发", "××烟酒批发", "××名酒超市"]
    }, {
        topcategory: "购物",
        subcategory: "文化用品",
        reclassify: "",
        rules: ["××文体办公用品", "××文具店", "××文体超市", "××文体用品商场", "××办公用品超市", "××文具行", "××办公耗材"]
    }, {
        topcategory: "生活服务",
        subcategory: "旅行社",
        reclassify: "",
        rules: ["××旅行社", "××旅行社有限公司", "××旅游公司", "××旅游接待中心", "××旅游集团", "××旅游总公司", "××旅游××门市", "××旅游集散中心"]
    }, {
        topcategory: "生活服务",
        subcategory: "票务代售",
        reclassify: "飞机票代售",
        rules: ["××航空售票点", "××航空售票处", "××机票代办处", "××航空票务有限公司", "××火车飞机票", "××大厦民航售票处"]
    }, {
        topcategory: "生活服务",
        subcategory: "票务代售",
        reclassify: "火车票代售",
        rules: ["××火车票代售点", "××火车票", "××铁路售票", "××铁路局××售票处"]
    }, {
        topcategory: "生活服务",
        subcategory: "票务代售",
        reclassify: "汽车票代售",
        rules: ["××客运售票厅", "××车站售票厅", "××长途大巴车电脑售票处", "××客车售票处"]
    }, {
        topcategory: "生活服务",
        subcategory: "票务代售",
        reclassify: "公交及IC卡",
        rules: ["××公交IC卡销售充值点", "××公交IC卡服务点", "××公共交通卡销售处", "××IC卡售卡充值处", "××公交IC卡售卡充值中心"]
    }, {
        topcategory: "生活服务",
        subcategory: "票务代售",
        reclassify: "景点售票",
        rules: ["××(名胜区)售票处", "××(风景区)售票处", "××公园售票处", "××(旅游区)售票处"]
    }, {
        topcategory: "生活服务",
        subcategory: "邮局速递",
        reclassify: "邮局",
        rules: ["××邮政局", "××邮电支局", "××邮政营业厅", "××邮政支局", "中国邮政缴费一站通营业厅", "××邮电营业厅", "××社区邮政服务中心"]
    }, {
        topcategory: "生活服务",
        subcategory: "邮局速递",
        reclassify: "速递",
        rules: ["××邮政局速递公司", "××邮政投递局", "××邮政速递公司", "××邮政速递营业厅", "××邮政××投递室", "××邮政物流局", "××邮政局××物流配送中心", "××邮政××物流配送中心", "××邮政局××投递部", "××邮政礼仪专递", "顺丰速运", "天天快递", "中通快递", "圆通快递", "申通", "韵达"]
    }, {
        topcategory: "生活服务",
        subcategory: "报刊亭",
        reclassify: "",
        rules: ["××报刊亭"]
    }, {
        topcategory: "生活服务",
        subcategory: "自来水营业厅",
        reclassify: "",
        rules: ["××自来水公司营业厅", "××自来水公司水费收缴大厅", "××自来水公司经营部", "××供水营业厅", "××购水营业厅"]
    }, {
        topcategory: "生活服务",
        subcategory: "电力营业厅",
        reclassify: "",
        rules: ["国家电网", "××供电营业所", "××电网公司××营业室", "××供电所", "××供电营业厅", "××供电公司"]
    }, {
        topcategory: "生活服务",
        subcategory: "摄影冲印",
        reclassify: "",
        rules: ["××相馆", "××影视工作室", "××数码摄影", "××彩扩部", "××图片社", "××艺术摄影", "××儿童摄影"]
    }, {
        topcategory: "生活服务",
        subcategory: "洗衣店",
        reclassify: "",
        rules: ["××干洗店", "××洗涤中心", "××水洗店", "××洗衣店"]
    }, {
        topcategory: "生活服务",
        subcategory: "教练",
        reclassify: "",
        rules: ["××私人教练中心"]
    }, {
        topcategory: "生活服务",
        subcategory: "生活服务场所",
        reclassify: "",
        rules: ["××刻字", "××计划生育服务站", "歌华有线", "××有线电视服务站"]
    }, {
        topcategory: "生活服务",
        subcategory: "信息咨询中心",
        reclassify: "",
        rules: ["××信息服务部", "××咨询中心", "××信息中心", "××咨询服务部", "××信息商行"]
    }, {
        topcategory: "生活服务",
        subcategory: "招聘求职",
        reclassify: "",
        rules: ["××劳动力市场", "××就业服务中心", "××职业介绍所", "××人才市场", "××人才服务中心", "××就业服务中心", "××人才服务站", "××就业市场", "××人力资源市场", "××劳动服务站", "××人力资源有限公司", "××人才交流服务中心", "××劳务有限公司", "××劳务派遣"]
    }, {
        topcategory: "生活服务",
        subcategory: "家政",
        reclassify: "家电维修",
        rules: ["××家电修理", "××电机修理", "××电脑修理", "××电器修理", "××维修部"]
    }, {
        topcategory: "生活服务",
        subcategory: "家政",
        reclassify: "管道疏通打孔",
        rules: ["××管道疏通", "××管道疏通公司"]
    }, {
        topcategory: "生活服务",
        subcategory: "宠物服务",
        reclassify: "宠物市场",
        rules: ["××宠物店", "××宠物市场", "××动物乐园(宠物类的)"]
    }, {
        topcategory: "生活服务",
        subcategory: "宠物服务",
        reclassify: "宠物医院",
        rules: ["××宠物医院", "××宠物诊所", "××动物诊所(非家禽类)", "动物疾病预防", "动物医院"]
    }, {
        topcategory: "生活服务",
        subcategory: "丧葬",
        reclassify: "",
        rules: ["××祭品店", "××殡葬大全", "××福寿园", "××花圈店", "××丧葬用品门市", "××陵园", "××墓地", "××公墓"]
    }, {
        topcategory: "生活服务",
        subcategory: "美容美发",
        reclassify: "瘦身纤体",
        rules: ["××专业美体瘦身", "××推脂按摩减肥", "××纤体", "××瘦身", "××减肥", "××产后恢复"]
    }, {
        topcategory: "生活服务",
        subcategory: "废品收购站",
        reclassify: "",
        rules: ["××废品回收站"]
    }, {
        topcategory: "生活服务",
        subcategory: "测字风水",
        reclassify: "",
        rules: ["××起名社"]
    }, {
        topcategory: "生活服务",
        subcategory: "美容美发",
        reclassify: "美发",
        rules: ["××发艺", "××美发室", "××美容美发", "××美发厅", "××发廊", "××烫染中心", "××发型设计中心", "××理发店"]
    }, {
        topcategory: "生活服务",
        subcategory: "美容美发",
        reclassify: "美甲",
        rules: ["××美甲店", "××美睫美甲"]
    }, {
        topcategory: "生活服务",
        subcategory: "美容美发",
        reclassify: "其它美容美发",
        rules: ["××美睫", "××刺青", "××纹身", "××纹眉"]
    }, {
        topcategory: "生活服务",
        subcategory: "其它生活服务",
        reclassify: "",
        rules: ["××农机维修", "××垃圾填埋场", "××手机充电站", "打字复印", "××复印部", "××广告", "××图文工作室"]
    }, {
        topcategory: "娱乐休闲",
        subcategory: "剧场音乐厅",
        reclassify: "剧场",
        rules: ["××歌剧城", "××剧院", "××歌剧院", "××二人转剧场", "××剧场", "××大戏楼", "刘老根大舞台", "××大戏院", "××马戏城"]
    }, {
        topcategory: "娱乐休闲",
        subcategory: "剧场音乐厅",
        reclassify: "音乐厅",
        rules: ["××音乐厅", "××音乐吧"]
    }, {
        topcategory: "娱乐休闲",
        subcategory: "户外活动",
        reclassify: "垂钓园",
        rules: ["××垂钓休闲中心", "××垂钓园", "××钓鱼场", "××垂钓中心"]
    }, {
        topcategory: "娱乐休闲",
        subcategory: "户外活动",
        reclassify: "采摘园",
        rules: ["××生态园", "××果园", "××采摘园"]
    }, {
        topcategory: "娱乐休闲",
        subcategory: "户外活动",
        reclassify: "露营地",
        rules: ["××青少年夏令营基地", "××营地", "××青少年野营基地", "花香果居房车露营地"]
    }, {
        topcategory: "娱乐休闲",
        subcategory: "户外活动",
        reclassify: "水上活动中心",
        rules: ["××水上乐园", "××水上运动基地", "××水上活動中心", "××戏水乐园", "××水上运动俱乐部", "××水上漂流", "××海上乐园"]
    }, {
        topcategory: "娱乐休闲",
        subcategory: "游戏棋牌",
        reclassify: "游戏厅",
        rules: ["××电玩城", "××游戏室", "××电玩", "××游戏厅", "××游艺厅"]
    }, {
        topcategory: "娱乐休闲",
        subcategory: "游戏棋牌",
        reclassify: "棋牌室",
        rules: ["××棋苑", "××棋牌", "××机麻超市", "××麻将馆"]
    }, {
        topcategory: "娱乐休闲",
        subcategory: "游戏棋牌",
        reclassify: "桌面游戏",
        rules: ["××桌面游戏","桌面游戏工作室"]
    }, {
        topcategory: "娱乐休闲",
        subcategory: "网吧",
        reclassify: "",
        rules: ["××网吧", "××网络广场", "××网城"]
    }, {
        topcategory: "娱乐休闲",
        subcategory: "迪厅",
        reclassify: "",
        rules: ["××DISCO", "××迪厅", "××的士高广场", "××迪吧", "××舞厅", "××歌舞厅"]
    }, {
        topcategory: "运动健身",
        subcategory: "健身中心",
        reclassify: "",
        rules: ["××健身俱乐部", "××康体中心", "××健美中心", "××生活会馆", "××健身操会馆", "××健身房", "××康体城", "××健身有限公司", "××健身馆"]
    }, {
        topcategory: "运动健身",
        subcategory: "游泳馆",
        reclassify: "",
        rules: ["××游泳馆", "××游泳池"]
    }, {
        topcategory: "运动健身",
        subcategory: "海滨浴场",
        reclassify: "",
        rules: ["××沙滩浴场", "××海水浴场", "××海滨浴场"]
    }, {
        topcategory: "运动健身",
        subcategory: "瑜伽",
        reclassify: "",
        rules: ["××瑜伽馆", "××瑜珈会馆", "马欣瑜伽普拉提"]
    }, {
        topcategory: "运动健身",
        subcategory: "羽毛球馆",
        reclassify: "",
        rules: ["××羽毛球馆", "××羽毛球俱乐部", "××羽毛球会所"]
    }, {
        topcategory: "运动健身",
        subcategory: "乒乓球馆",
        reclassify: "",
        rules: ["××乒乓球娱乐城", "××乒乓球俱乐部", "××乒乓球室", "××乓球训练中心", "××乒乓球馆", "××乒乓球厅"]
    }, {
        topcategory: "运动健身",
        subcategory: "网球场",
        reclassify: "",
        rules: ["××网球场", "××网球俱乐部", "××网球馆", "××网球中心"]
    }, {
        topcategory: "运动健身",
        subcategory: "篮球场",
        reclassify: "",
        rules: ["××篮球场", "××篮球俱乐部", "××篮球馆", "××篮球广场"]
    }, {
        topcategory: "运动健身",
        subcategory: "足球场",
        reclassify: "",
        rules: ["××足球场", "××足球俱乐部", "××足球练习场"]
    }, {
        topcategory: "运动健身",
        subcategory: "壁球场",
        reclassify: "",
        rules: ["××壁球室", "××壁球馆"]
    }, {
        topcategory: "运动健身",
        subcategory: "橄榄球",
        reclassify: "",
        rules: ["××橄榄球场"]
    }, {
        topcategory: "运动健身",
        subcategory: "马术",
        reclassify: "",
        rules: ["××骑士园俱乐部", "××马术俱乐部"]
    }, {
        topcategory: "运动健身",
        subcategory: "赛马场",
        reclassify: "",
        rules: ["××骑马场", "××赛马场", "马主廂房××段", "董事廂房", "××跑马场"]
    }, {
        topcategory: "运动健身",
        subcategory: "高尔夫场",
        reclassify: "",
        rules: ["××高尔夫球场", "××高尔夫俱乐部", "××高尔夫球会"]
    }, {
        topcategory: "运动健身",
        subcategory: "保龄球馆",
        reclassify: "",
        rules: ["××保龄球馆", "××保龄球俱乐部", "××保龄球中心", "××保龄球广场", "××保龄中心", "××保龄"]
    }, {
        topcategory: "运动健身",
        subcategory: "台球馆",
        reclassify: "",
        rules: ["××桌球俱乐部", "××台球厅", "××斯诺克", "××8球俱乐部", "××台球俱乐部", "××桌球室", "××台球室", "××台球"]
    }, {
        topcategory: "运动健身",
        subcategory: "滑雪",
        reclassify: "",
        rules: ["××滑雪场", "××滑雪活动中心", "××雪乐园"]
    }, {
        topcategory: "运动健身",
        subcategory: "溜冰",
        reclassify: "",
        rules: ["××溜冰场", "××旱冰场", "××溜轮滑俱乐部", "××滑冰俱乐部", "××滑冰馆"]
    }, {
        topcategory: "运动健身",
        subcategory: "跆拳道",
        reclassify: "",
        rules: ["××跆拳道馆", "××跆拳道培训中心", "跆拳道俱乐部"]
    }, {
        topcategory: "运动健身",
        subcategory: "综合体育场馆",
        reclassify: "",
        rules: ["××体育场", "××体育馆", "××体育中心", "××运动场"]
    }, {
        topcategory: "汽车",
        subcategory: "驾校",
        reclassify: "",
        rules: ["××驾驶员培训中心", "××机动车驾驶学校", "××驾校", "××驾驶学校培训场", "××交警大队考试场", "××驾驶员培训学校", "××驾驶员培训公司"]
    }, {
        topcategory: "汽车",
        subcategory: "汽车租赁",
        reclassify: "",
        rules: ["××汽车租赁", "神州租车(北京站店)", "一嗨租车"]
    }, {
        topcategory: "汽车",
        subcategory: "汽车养护",
        reclassify: "",
        rules: ["××汽车美容", "××汽车抛光", "××汽车保洁", "××汽车专业贴膜中心", "××汽车用品", "××汽车装具"]
    }, {
        topcategory: "汽车",
        subcategory: "洗车场",
        reclassify: "",
        rules: ["××洗车场", "××汽车美容浴馆", "××洗车台", "××洗车行", "××洗车城", "××洗车站", "××洗车", "××洗车装具", "××洗车房", "××车浴", "××洗车美容", "××汽车清洗服务部"]
    }, {
        topcategory: "汽车",
        subcategory: "汽车俱乐部",
        reclassify: "",
        rules: ["××车友俱乐部", "××车迷乐园", "××车友之家"]
    }, {
        topcategory: "汽车",
        subcategory: "汽车救援",
        reclassify: "",
        rules: ["××汽车维修救援中心", "××汽车24小时急救", "××吊车施救服务部", "××汽车救援俱乐部", "××车辆施救服务中心"]
    }, {
        topcategory: "汽车",
        subcategory: "汽车配件销售",
        reclassify: "",
        rules: ["××汽配专卖店", "××轮胎行", "××汽车音响", "××汽配城", "××汽车电器", "××汽车玻璃"]
    }, {
        topcategory: "汽车",
        subcategory: "二手车交易市场",
        reclassify: "",
        rules: ["××二手车交易中心", "××二手车市场"]
    }, {
        topcategory: "汽车",
        subcategory: "车辆管理机构",
        reclassify: "",
        rules: ["××公安局车辆管理所", "××机动车办证服务大厅", "××车辆管理服务大厅", "××机动车驾驶员服务中心"]
    },
];

function findMatchedCategory() {
    var poiName = $('#name').val();
    // aserrt(poiName != "")
    for (var i = 0; i < classifyRules.length; i++) {
        for (var j = 0; j < classifyRules[i].rules.length; j++) {
            var strig = classifyRules[i].rules[j];
            if (strig.indexOf('××') > -1) {
                //只在末尾出现
                var len = strig.length;
                if (poiName.length >= len) {
                    var newstrig = strig.substring(2, len + 1);
                    var newVal = poiName.substring(poiName.length + 2 - len, poiName.length + 1);
                    if (newstrig == newVal) {
                        var selectedMsg = {};
                        selectedMsg.topcategory = classifyRules[i].topcategory;
                        selectedMsg.subcategory = classifyRules[i].subcategory;
                        selectedMsg.reclassify = classifyRules[i].reclassify;
                        selectedMsg.action = 'SET_SELECT_VAL';
                        console.log("Matched:", selectedMsg);
                        return selectedMsg;
                    }
                }
            } else {
                if (poiName == strig) {
                    //精确匹配
                    var selectedMsg = {};
                    selectedMsg.topcategory = classifyRules[i].topcategory;
                    selectedMsg.subcategory = classifyRules[i].subcategory;
                    selectedMsg.reclassify = classifyRules[i].reclassify;
                    selectedMsg.action = 'SET_SELECT_VAL';
                    console.log("Matched exactly:", selectedMsg);
                    return selectedMsg;
                }
            }
        }
    }
    return null;
}