var submitRules = [
    {
        "type": "地主",
        "subtype": [
            "地主认证聚合",
            "地主认证新增"
        ],
        "allowedResult": [
            "数据修改",
            "新增数据",
            "只挂关系"
        ],
        "deletedReasons": [
            "您反馈的名称不规范，请使用门店招牌，如“德克士(X路店)”，请修改后重新提交！",
            "您标注的位置坐标与地址指向不一致，如“德克士(中山路店)”对应地址未在中山路，请您核实后重新提交！",
            "请您补充门店所在位置信息详情后重新提交，如“X路X号”或“X路与X交汇处向北100米”",
            "您反馈的名称与地址不一致，如“德克士(中山路店)”对应地址和坐标应指向中山路，请您核实后重新提交！",
            "您反馈的地址信息指向多个不同位置，请修改地址为唯一位置后重新提交！",
            "您反馈的信息疑似错误，但电话无法与您取得联系，请您确认后重新提交，保持电话畅通！",
            "您反馈信息中的电话错误(空号/号码少或多位/无号码/无响应)，请您修改后重新提交！",
            "您反馈的地点因营业执照/门脸照不清晰，请您重新拍摄后提交！",
            "您反馈的门店地址与营业执照上地址不一致，请您核实后重新提交！",
            "您反馈的门店名称与营业执照/门脸照不一致，请您核实后重新提交！",
            "您反馈的地点营业执照无效(过期/非营业执照)，请您修改后重新提交！",
            "测试数据，地图暂未支持功能测试需求，请您谅解！",
            "您反馈的内容为无实体门店/临时类别数据，我们暂未采纳您的反馈，感谢您的支持！",
            "您反馈的店铺还在筹建中，为避免用户到店后无法享受服务，请店铺开业后再提交反馈！",
            "该地点的反馈已在处理中，您无需重复提交，感谢您的反馈！",
            "经核实店主并未添加此地点，请您谅解，感谢您的支持！",
            "经核实，线上数据是正确的，感谢您反馈其他问题！备注：此类信息反馈给用户的状态为已采纳",
            "此POI重复",
            "此地点已关闭",
            "此地点已搬迁",
            "错误数据（位置或名称错误）",
            "非法数据--奢靡反动色情等"
        ]
    },
    {
        "type": "微信",
        "subtype": [
            "微信聚合审核",
            "微信新增审核"
        ],
        "allowedResult": [
            "数据正确",
            "数据修改",
            "新增数据",
            "只挂关系"
        ],
        "deletedReasons": [
            "名称不规范，请修改后重新提交",
            "名称指向位置和地址冲突，请修改后重新提交",
            "名称和地址分类实体冲突，请修改后重新提交",
            "分店名和连锁品牌名未进行区分，请修改后重新提交",
            "地址错误，请修改后重新提交",
            "地址不详细，请修改后重新提交",
            "地址中多个位置描述指向不一致，请修改后重新提交",
            "坐标错误，请修改后重新提交",
            "分类错误，请修改后重新提交",
            "电话接通不配合，核实不通过",
            "电话无法核实(忙音/无人接听)，请保持电话畅通",
            "电话错误(空号/号码少或多位/无号码/无响应)，请修改后重新提交",
            "测试数据，不予受理",
            "相同数据多次提交，请删除重复数据",
            "经核实您所提交的店铺已关闭，不予受理",
            "经核实店主并未添加此点，故拒绝",
            "店铺正在筹建中，我方暂不受理",
            "亲爱的用户，感谢您的支持！此类POI(无实体;活动性质)我方暂未受理，请您谅解",
            "门店实体不明确，请修改为门店的主体名称后重新提交!",
            "此POI重复",
            "此地点已关闭",
            "此地点已搬迁",
            "错误数据（位置或名称错误）",
            "非法数据--奢靡反动色情等"
        ]
    },
    {
        "type": "手图add",
        "subtype": [
            "手图add新增审核"
        ],
        "allowedResult": [
            "数据正确",
            "数据修改",
            "新增数据",
            "正常审核",
            "不处理类型"
        ],
        "deletedReasons": [
            "您反馈的名称不规范，请使用门店招牌，如“德克士(X路店)”，请修改后重新提交！",
            "您反馈的名称与地址不一致，如“德克士(中山路店)”对应地址和坐标应指向中山路，请您核实后重新提交！",
            "您标注的位置坐标与地址指向不一致，如“德克士(中山路店)”对应地址未在中山路，请您核实后重新提交！",
            "请您补充门店所在位置信息详情后重新提交，如“X路X号”或“X路与X交汇处向北100米”",
            "您反馈的地址信息指向多个不同位置，请修改地址为唯一位置后重新提交！",
            "请您根据门店所经营的性质修改分类后重新提交！",
            "您反馈的信息疑似错误，但电话无法与您取得联系，请您确认后重新提交，保持电话畅通！",
            "您反馈信息中的电话错误(空号/号码少或多位/无号码/无响应)，请您修改后重新提交！",
            "您反馈的地点因营业执照/门脸照不清晰，请您重新拍摄后提交！",
            "您反馈的门店名称与营业执照/门脸照不一致，请您核实后重新提交！",
            "您反馈的内容为无实体门店/临时类别数据，我们暂未采纳您的反馈，感谢您的支持！",
            "您反馈的店铺还在筹建中，为避免用户到店后无法享受服务，请店铺开业后再提交反馈！",
            "经核实您所提交的门店已关闭，我们暂未采纳您的反馈，感谢您的支持！",
            "该地点的反馈已在处理中，您无需重复提交，感谢您的反馈！",
            "经核实店主并未添加此地点，请您谅解，感谢您的支持！",
            "经核实，线上数据是正确的，感谢您反馈其他问题！",
            "感谢您的反馈，但我们尽全力后仍无法核实，请帮忙提供更多辅助核实信息，如现场拍照、增加问题详细描述等！",
            "此POI重复",
            "此地点已关闭",
            "此地点已搬迁",
            "错误数据（位置或名称错误）",
            "非法数据--奢靡反动色情等"
        ]
    },
    {
        "type": "手图&web纠错",
        "subtype": [
            "web纠错",
            "手图纠错"
        ],
        "allowedResult": [
            "数据正确",
            "数据修改",
            "不处理类型"
        ],
        "deletedReasons": [
            "感谢您对地图的关注，请填写正确的描述信息辅助说明问题后重新提交，谢谢！",
            "您反馈信息中的电话错误(空号/号码少或多位/无号码/无响应)，请您修改后重新提交！",
            "您反馈的内容为无实体门店/临时类别数据，我们暂未采纳您的反馈，感谢您的支持！",
            "经核实，线上数据是正确的，感谢您反馈其他问题！备注：此类信息反馈给用户的状态为已采纳",
            "感谢您的反馈，但我们尽全力后仍无法核实，请帮忙提供更多辅助核实信息，如现场拍照、增加问题详细描述等！",
            "您的反馈相关团队已在处理，感谢您的支持！",
            "此POI重复",
            "此地点已关闭",
            "此地点已搬迁",
            "错误数据（位置或名称错误）",
            "非法数据--奢靡反动色情等"
        ]
    },
    {
        "type": "新增挖掘",
        "subtype": [
            "用户行为新增挖掘"
        ],
        "allowedResult": [
            "数据修改",
            "新增数据",
            "只挂关系"
        ],
        "deletedReasons": [
            "名称不规范，请修改后重新提交",
            "名称指向位置和地址冲突，请修改后重新提交",
            "名称和地址分类实体冲突，请修改后重新提交",
            "分店名和连锁品牌名未进行区分，请修改后重新提交",
            "地址错误，请修改后重新提交",
            "地址不详细，请修改后重新提交",
            "地址中多个位置描述指向不一致，请修改后重新提交",
            "坐标错误，请修改后重新提交",
            "分类错误，请修改后重新提交",
            "电话接通不配合，核实不通过",
            "电话无法核实(忙音/无人接听)，请保持电话畅通",
            "电话错误(空号/号码少或多位/无号码/无响应)，请修改后重新提交",
            "测试数据，不予受理",
            "相同数据多次提交，请删除重复数据",
            "经核实您所提交的店铺已关闭，不予受理",
            "经核实店主并未添加此点，故拒绝",
            "店铺正在筹建中，我方暂不受理",
            "亲爱的用户，感谢您的支持！此类POI(无实体;活动性质)我方暂未受理，请您谅解",
            "门店实体不明确，请修改为门店的主体名称后重新提交!",
            "名称错误，请修改后提交！",
            "此POI重复",
            "此地点已关闭",
            "此地点已搬迁",
            "错误数据（位置或名称错误）",
            "非法数据--奢靡反动色情等"
        ]
    },
    {
        "type": "纠错挖掘",
        "subtype": [
            "重点疑似数据挖掘-坐标疑似"
        ],
        "allowedResult": [
            "数据正确",
            "数据修改",
            "正常审核"
        ],
        "deletedReasons": [
            "经核实，线上数据是正确的，欢迎您反馈其他问题！",
            "此POI重复",
            "此地点已关闭",
            "此地点已搬迁",
            "错误数据（位置或名称错误）",
            "非法数据--奢靡反动色情等"
        ]
    },
    {
        "type": "新闻挖掘",
        "subtype": [
            "新闻挖掘PP数据审核",
            "新闻挖掘数据审核"
        ],
        "allowedResult": [
            "数据修改",
            "新增数据",
            "无法判定",
            "正常审核",
            "不处理类型"
        ],
        "deletedReasons": [
            "经核实您所提交的店铺已关闭，不予受理",
            "此POI重复",
            "此地点已关闭",
            "此地点已搬迁",
            "错误数据（位置或名称错误）",
            "非法数据--奢靡反动色情等"
        ]
    }
];

function getSubmitRules(taskType) {
    for (var i = 0; i < submitRules.length; i++) {
        for (var j = 0; j < submitRules[i].subtype.length; j++) {
            if (submitRules[i].subtype[j] == taskType) {
                return {
                    "allowedResult": new Set(submitRules[i].allowedResult),
                    "deletedReasons": new Set(submitRules[i].deletedReasons)
                }
            }
        }
    }
    console.log("Can not find the submit rules");
    return null;
}